# Exercise 3 SQLite #Referential Integrity

DATABASES 
Employee Referential Integrity:-Maintain the data consistency between two tables.
the value can be null as the student may not have taken any course.Rules are made in te database structure
about how foreign keys should be used to ensure that changes,addition and deletion in the database maintain the data integraity.
The refertial integraity constraints state that if a forgien key in the first table refers to the primary key of the second 
table then every value of foregign key in the first table should either be null or present in the second table

In [30]:
import sqlite3

In [31]:
db=sqlite3.connect("C:/MySQLite_Database/studentdb.db/student_course_database.db")

In [32]:
cur=db.cursor()

constraints -----
uniqenter only unoque values ,no duplicate values
not null --- no blank values can be inserted in table

In [33]:
cur.execute("create table course(courseid int primary key,coursename text,duration int)")

In [34]:
cur.execute("create table student(roll_no int primary key,studentname text,age int,courseid int,foreign key(courseid) references course(courseid))")

In [35]:
cur.execute("insert into course values(78,'Data Science',12),(56,'Python course',4),(101,'Database',7)")

print(cur.rowcount,"record(s) inserted ")

db.commit;

3 record(s) inserted

In [36]:
cur.execute("insert into student values(1,'Jack',22,78),(2,'John',21,56),(3,'Rudolf',18,78),(4,'Jim',21,56)")

print(cur.rowcount,"record(s) inserted ")

db.commit;

4 record(s) inserted

In [37]:
results=cur.execute('select * from course')

results.fetchall()

[(78, 'Data Science', 12), (56, 'Python course', 4), (101, 'Database', 7)]

In [38]:
results=cur.execute('select * from student')

results.fetchall()

[(1, 'Jack', 22, 78),
 (2, 'John', 21, 56),
 (3, 'Rudolf', 18, 78),
 (4, 'Jim', 21, 56)]

In [39]:
results=cur.execute('select courseid from course where coursename="Data Science"')

for i in results:
    print(i)

(78,)

# Subquery

In [40]:
results=cur.execute('select * from student where courseid=(select courseid from course where coursename="Data Science")')

results.fetchall()

[(1, 'Jack', 22, 78), (3, 'Rudolf', 18, 78)]

In [41]:
results=cur.execute('select * from student where courseid=(select courseid from course where coursename="Python course")')

results.fetchall()

[(2, 'John', 21, 56), (4, 'Jim', 21, 56)]

# Join

Different Types of SQL JOINs

.(INNER) JOIN:Returns records that have matching values in both tables.
.LEFT(OUTER)JOIN: Returns all records from the left table and the matched records from the right table.
.RIGHT(OUTER)JOIN:Returns all records from the right table and the matched records from the left table.
.FULL(OUTER)JOIN:Returns all records when there is a match in either left or righr table.

# INNER JOIN

In [42]:
sq1 = "SELECT student.roll_no, student.studentname, course.courseid, course.coursename FROM student INNER JOIN course ON student.courseid = course.courseid"
results = cur.execute(sq1)
for row in results:
    print(row)

(1, 'Jack', 78, 'Data Science')
(2, 'John', 56, 'Python course')
(3, 'Rudolf', 78, 'Data Science')
(4, 'Jim', 56, 'Python course')

# LEFT JOIN

In [43]:
sq1 = "SELECT student.roll_no, student.studentname, course.courseid, course.coursename FROM student LEFT JOIN course ON student.courseid = course.courseid"
results = cur.execute(sq1)
for row in results:
    print(row)

(1, 'Jack', 78, 'Data Science')
(2, 'John', 56, 'Python course')
(3, 'Rudolf', 78, 'Data Science')
(4, 'Jim', 56, 'Python course')

In [44]:
sq1 = "SELECT student.roll_no, student.studentname, course.courseid, course.coursename FROM course LEFT JOIN student ON student.courseid = course.courseid"
results = cur.execute(sq1)
for row in results:
    print(row)

(1, 'Jack', 78, 'Data Science')
(3, 'Rudolf', 78, 'Data Science')
(2, 'John', 56, 'Python course')
(4, 'Jim', 56, 'Python course')
(None, None, 101, 'Database')

RIGHT JOIN and FULL OUTER JOIN NOT SUPPORTED IN SQLITE